In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()         # Creating an Empty DataFrame
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
df2 = pd.DataFrame([[1,20,3,4,30],[456,231,63,21,56],[4,672,9,10,4],[1,67,76,2,3],[32,67,42,8]])
df2

     0    1   2   3     4
0    1   20   3   4  30.0
1  456  231  63  21  56.0
2    4  672   9  10   4.0
3    1   67  76   2   3.0
4   32   67  42   8   NaN

In [4]:
df2.head(3)

     0    1   2   3     4
0    1   20   3   4  30.0
1  456  231  63  21  56.0
2    4  672   9  10   4.0

In [5]:
df2.tail(2)

    0   1   2  3    4
3   1  67  76  2  3.0
4  32  67  42  8  NaN

In [6]:
df2.shape

(5, 5)

In [7]:
print(df2.iloc[0])
print('\t')
print(df2.iloc[2])

0     1.0
1    20.0
2     3.0
3     4.0
4    30.0
Name: 0, dtype: float64

0      4.0
1    672.0
2      9.0
3     10.0
4      4.0
Name: 2, dtype: float64

In [8]:
print(df2.iloc[0,1])
print(df2.iloc[3,2])

20
76

In [9]:
df2.iloc[0:2]

     0    1   2   3     4
0    1   20   3   4  30.0
1  456  231  63  21  56.0

In [10]:
df2.iloc[0:2 ,0:3]

     0    1   2
0    1   20   3
1  456  231  63

In [11]:
df2.iloc[0:2 ,1:3]

     1   2
0   20   3
1  231  63

In [12]:
df3 = pd.DataFrame([[1,20,3,4,30],[456,231,63,21,56],[4,672,9,10,4],[1,67,76,2,3],[32,67,42,8,100]],columns=['A','B','C','D','E'])
df3

     A    B   C   D    E
0    1   20   3   4   30
1  456  231  63  21   56
2    4  672   9  10    4
3    1   67  76   2    3
4   32   67  42   8  100